What is Pandas?

Pandas is a Python library for data manipulation and analysis.
It provides two main data structures:

Series → 1D labeled array (like one column)

DataFrame → 2D labeled table (like an Excel sheet)

**1.Creating Data Structures**

 **1.1:Series (1D)**

In [132]:
import pandas as pd 
import numpy as np 
#from Tuple 
series=pd.Series((1,3,4,5,6,8),index=[1,2,3,4,5,6])
#from List
series2=pd.Series([1,2,3,4,5,np.nan,10])
#from Dictionary 
series3=pd.Series({"Name":"Foysal","Roll":210122,"Department":"CSE"})
#from Custom index 
dataframe4=pd.DataFrame((2,3,np.nan),index=['x','y','z'])
#Print Series
print(series,series2,"\n",series3,series4)
#Print type of pandas data structure type
print(type(series),type(series2),type(series3),type(series4))
#Datatype Check
print((series.dtypes,series2.dtypes,series3.dtypes,series4.dtypes))

1    1
2    3
3    4
4    5
5    6
6    8
dtype: int64 0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     NaN
6    10.0
dtype: float64
 Name          Foysal
Roll          210122
Department       CSE
dtype: object
<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>
(dtype('int64'), dtype('float64'), dtype('O'), dtype('float64'))

**1.2:DataFrame (2D)**

In [136]:
import pandas as pd 
import numpy as np 
#from Tuple 
dataframe=pd.DataFrame((1,3,4,5,6,np.nan,8),index=[1,2,3,4,5,6,7])
#from List
dataframe2=pd.DataFrame([1,2,3,4,5,np.nan,10],index=[1,2,3,4,5,6,7])
#from Dictionary 
dataframe3=pd.DataFrame({"Name":"Foysal","Roll":210122,"Department":"CSE"},index=[1,2,3])
#from Custom index 
dataframe4=pd.DataFrame((2,3,np.nan),index=['x','y','z'])
#Print dataframe  
print(dataframe,dataframe2,"\n",dataframe3,dataframe4)
#Print Pandas Data Structure type
print(type(dataframe),type(dataframe2),type(dataframe3),type(dataframe4))
print("\n")
#Datatype Check
print((dataframe.dtypes,dataframe2.dtypes,dataframe3.dtypes,dataframe4.dtypes))

     0
1  1.0
2  3.0
3  4.0
4  5.0
5  6.0
6  NaN
7  8.0       0
1   1.0
2   2.0
3   3.0
4   4.0
5   5.0
6   NaN
7  10.0
      Name    Roll Department
1  Foysal  210122        CSE
2  Foysal  210122        CSE
3  Foysal  210122        CSE      0
x  2.0
y  3.0
z  NaN
<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'> <class 'pandas.core.frame.DataFrame'>


(0    float64
dtype: object, 0    float64
dtype: object, Name          object
Roll           int64
Department    object
dtype: object, 0    float64
dtype: object)

**2.Data Read and Write**

**2.1:Files Read**

In [294]:
import pandas as pd
df=pd.read_csv("customers-100.csv")
df.loc[:5]

,Unnamed: 0,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
5,5,6,2d08FB17EE273F4,Aimee,Downs,Steele Group,Chavezborough,Bosnia and Herzegovina,(283)437-3886x88321,999-728-1637,louis27@gilbert.com,2020-02-25,http://www.berger.net/

**2.2:Write files**

In [10]:
import pandas as pd
df=pd.read_csv("customers-100.csv")
df.to_csv("customers-100.csv",index=False)#index=False means don’t write row numbers

**3.Data Inspection**

In [27]:
import pandas as pd
df=pd.read_csv("customers-100.csv")
#df.head(10)# Default first 5 rows
#df.tail(10)# Default last 5 rows
#df.shape#shape
df.info()         # Data types & memory
df.describe()     # Statistical summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         100 non-null    int64
 1   Index              100 non-null    int64
 2   Customer Id        100 non-null    object
 3   First Name         100 non-null    object
 4   Last Name          100 non-null    object
 5   Company            100 non-null    object
 6   City               100 non-null    object
 7   Country            100 non-null    object
 8   Phone 1            100 non-null    object
 9   Phone 2            100 non-null    object
 10  Email              100 non-null    object
 11  Subscription Date  100 non-null    object
 12  Website            100 non-null    object
dtypes: int64(2), object(11)
memory usage: 10.3+ KB

       Unnamed: 0       Index
count  100.000000  100.000000
mean    49.500000   50.500000
std     29.011492   29.011492
min      0.000000    1.000000
25%     24.750000   25.750000
50%     49.500000   50.500000
75%     74.250000   75.250000
max     99.000000  100.000000

In [300]:
import pandas as pd
df=pd.read_csv("customers-100.csv")
df.tail(5)

,Unnamed: 0,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
95,95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

**4. Data Selection**

**4.1:Column Selection**

In [45]:
#Single column (Series)
print(df["City"])
#Multiple Column (DataFrame)
print(df[["First Name","Company","Country"]])

0          East Leonard
1     East Jimmychester
2         Isabelborough
3            Bensonview
4        West Priscilla
            ...
95         East Richard
96         New Bradview
97           Ortegaland
98      Lake Elijahview
99            Judymouth
Name: City, Length: 100, dtype: object
   First Name                          Company                     Country
0      Sheryl                  Rasmussen Group                       Chile
1     Preston                      Vega-Gentry                    Djibouti
2         Roy                    Murillo-Perry         Antigua and Barbuda
3       Linda  Dominguez, Mcmillan and Donovan          Dominican Republic
4      Joanna         Martin, Lang and Andrade  Slovakia (Slovak Republic)
..        ...                              ...                         ...
95       Karl                        Carey LLC                      Guyana
96       Lynn            Ware, Burns and Oneal                   Sri Lanka
97       Fred                    Schmitt-Jones             Solomon Islands
98     Yvonne               Fitzgerald-Harrell                       Aruba
99   Clarence               Le, Nash and Cross                    Honduras

[100 rows x 3 columns]

**4.2:Row Selection**

In [303]:
df[0:3]  # Rows 0-2

,Unnamed: 0,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/

**By loc[] (Label-based) with range**

In [69]:

#df.loc[10:15]#Row Range 10 to 15
#df.loc[10:15,"Company"]# All rows, 1 column 
#df.loc[10:15,["Country","Company","City"]]# All rows, TWO or more column
df.loc[3,"City"]# Specific cell

Empty DataFrame
Columns: [Unnamed: 0, Index, Customer Id, First Name, Last Name, Company, City, Country, Phone 1, Phone 2, Email, Subscription Date, Website]
Index: []

**.iloc[] (Position-based) with range**

In [72]:
df.iloc[10]

Unnamed: 0                                    10
Index                                         11
Customer Id                      216E205d6eBb815
First Name                                  Carl
Last Name                              Schroeder
Company               Oconnell, Meza and Everett
City                                Shannonville
Country                                 Guernsey
Phone 1                         637-854-0256x825
Phone 2                         114.336.0784x788
Email                         kirksalas@webb.com
Subscription Date                     2021-10-20
Website              https://simmons-hurley.com/
Name: 10, dtype: object

In [305]:
df.iloc[5:10,0:5]#Rows 0-10 and columns 0-5

   Unnamed: 0  Index      Customer Id First Name  Last Name
5           5      6  2d08FB17EE273F4      Aimee      Downs
6           6      7  EA4d384DfDbBf77     Darren       Peck
7           7      8  0e04AFde9f225dE      Brett     Mullen
8           8      9  C2dE4dEEc489ae0     Sheryl     Meyers
9           9     10  8C2811a503C7c5a   Michelle  Gallagher

In [307]:
#df.loc[[1,7,8,19]]#Specific Rows
df.iloc[[1,7,8,19]]#same as above

,Unnamed: 0,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
1,1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
7,7,8,0e04AFde9f225dE,Brett,Mullen,"Sanford, Davenport and Giles",Kimport,Bulgaria,001-583-352-7197x297,001-333-145-0369,asnow@colon.com,2021-04-12,https://hammond-ramsey.com/
8,8,9,C2dE4dEEc489ae0,Sheryl,Meyers,Browning-Simon,Robersonstad,Cyprus,854-138-4911x5772,+1-448-910-2276x729,mariokhan@ryan-pope.org,2020-01-13,https://www.bullock.net/
19,19,20,0F60FF3DdCd7aB0,Joanna,Kirk,Mays-Mccormick,Jamesshire,French Polynesia,(266)131-7001x711,(283)312-5579x11543,tuckerangie@salazar.net,2021-09-24,https://www.camacho.net/

**5. Data Cleaning**

**5.1:Handling Missing Values**

In [325]:
df.isnull() # Boolean mask of NaN
#df.notnull()# Inverse of isnull
df.head(10)

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
0,NaN,Student_1,16,Female,88,26.0,26.0,93.0,Poor
1,NaN,Student_2,16,NaN,59,48.5,8.0,65.0,Poor
2,NaN,NaN,17,Female,40,78.0,61.0,NaN,NaN
3,S004,NaN,16,Male,28,14.0,36.0,NaN,Excellent
4,S005,NaN,19,Female,14,89.0,96.0,NaN,NaN
5,S006,Student_6,16,Male,44,41.0,50.0,92.0,Poor
6,S007,Student_7,16,NaN,44,76.0,54.1,68.0,Good
7,NaN,Student_8,16,NaN,88,48.5,54.1,65.0,Poor
8,NaN,Student_9,16,NaN,70,62.0,78.0,75.0,Poor
9,S010,NaN,19,NaN,8,48.5,54.1,88.0,Good

In [112]:
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
#df.isnull() # Boolean mask of NaN
df.dropna() # Drop rows with NaN

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
5,S006,Student_6,16.0,Male,44.0,41.0,50.0,92.0,Poor
28,S029,Student_29,18.0,Female,33.0,44.0,53.0,84.0,Excellent

In [327]:
#df.dropna(axis=1)# Drop columns with NaN
df.fillna("X")
df[10:15]

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
10,S011,Student_11,16,NaN,44,51.0,31.0,62.0,NaN
11,S012,Student_12,17,Female,0,48.5,54.1,79.0,NaN
12,NaN,NaN,16,Female,7,3.0,54.1,95.0,Good
13,NaN,Student_14,16,Female,87,48.5,54.1,78.0,Excellent
14,S015,Student_15,16,NaN,62,48.5,61.0,85.0,Average

In [116]:
# Check total missing values per column
print(df.isna().sum())

Student_ID       21
Name             21
Age              25
Gender           18
Math_Score       16
English_Score    19
Science_Score    19
Attendance(%)    19
Remarks          24
dtype: int64

In [118]:
# Check if any missing value exists
print(df.isna().any())

Student_ID       True
Name             True
Age              True
Gender           True
Math_Score       True
English_Score    True
Science_Score    True
Attendance(%)    True
Remarks          True
dtype: bool

In [120]:
#Get percentage of missing values per column 
print((df.isna().mean()*100).round(2))

Student_ID       42.0
Name             42.0
Age              50.0
Gender           36.0
Math_Score       32.0
English_Score    38.0
Science_Score    38.0
Attendance(%)    38.0
Remarks          48.0
dtype: float64

In [319]:
# Fill numeric columns with their mean
import numpy as np
df["Math_Score"]=df["Math_Score"].fillna(df["Math_Score"].mean()).round(1)
df["English_Score"]=df["English_Score"].fillna(df["English_Score"].mean()).round(1)
df["Science_Score"]=df["Science_Score"].fillna(df["Science_Score"].mean()).round(1)

# Convert Age to numeric (in case some values are still strings)
df["Age"] = pd.to_numeric(df["Age"], errors='coerce')
# Fill NaN values with the mean of the Age column, rounded if you want
df["Age"] = df["Age"].fillna(df["Age"].mean().round(1))
df[0:5]

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
0,NaN,Student_1,16.9,Female,88.0,26.0,26.0,93.0,Poor
1,NaN,Student_2,16.9,NaN,59.0,48.5,8.0,65.0,Poor
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN,NaN
3,S004,NaN,16.9,Male,28.0,14.0,36.0,NaN,Excellent
4,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN,NaN

**5.2:Type Conversion**

In [313]:
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")

In [321]:
df = df.astype({'Age': float, 'Math_Score': int})
df["Age"]=df["Age"].astype(int)
df.loc[2:5]

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
2,NaN,NaN,17,Female,40,78.0,61.0,NaN,NaN
3,S004,NaN,16,Male,28,14.0,36.0,NaN,Excellent
4,S005,NaN,19,Female,14,89.0,96.0,NaN,NaN
5,S006,Student_6,16,Male,44,41.0,50.0,92.0,Poor

In [323]:

print(type(df["Age"]))

<class 'pandas.core.series.Series'>

**5.3:Renaming**

In [288]:
df.rename(columns={"Name":"Full Name","Student_ID":"ID"})#Renaming column
df.rename(index={0:'First'})#Renaming index
df.loc[[1,2,6,8,10,15]]

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks,Category,Age_in_10_years,Bangladesh Study
1,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0,Poor,Young,NaN,90.0
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN,NaN,Young,27.0,88.0
6,S007,Student_7,NaN,NaN,NaN,76.0,NaN,68.0,Good,Young,NaN,60.0
8,NaN,Student_9,NaN,NaN,70.0,62.0,78.0,75.0,Poor,Young,NaN,33.0
10,S011,Student_11,NaN,NaN,NaN,51.0,31.0,62.0,NaN,Young,NaN,81.0
15,NaN,Student_16,16.0,Female,10.0,NaN,57.0,62.0,NaN,Young,26.0,93.0

**6. Data Transformation**

**6.1:Adding/Removing Columns**

In [284]:
#Direct Assignment
df["Bangladesh Study"]=[85, 90, 88,np.nan,57,34,60,74,33,72,81,73,91,32,73,93,75,85, 90, 88,49,57,34,60,74,np.nan,72,81,73,91,np.nan,73,93,75,85, 90, 88,49,57,34,60,74,np.nan,72,81,73,91,32,73,93]
df.head(5)

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks,Category,Age_in_10_years,Bangladesh Study
0,NaN,Student_1,NaN,Female,88.0,26.0,26.0,93.0,Poor,Young,NaN,85.0
1,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0,Poor,Young,NaN,90.0
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN,NaN,Young,27.0,88.0
3,S004,NaN,NaN,Male,28.0,14.0,36.0,NaN,Excellent,Young,NaN,NaN
4,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN,NaN,Adult,29.0,57.0

In [282]:
#Add column using calculation
df['Age_in_10_years'] = df['Age'] + 10
df.tail()

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks,Category,Age_in_10_years
45,S046,Student_46,15.0,Female,NaN,61.0,55.0,NaN,NaN,Young,25.0
46,NaN,NaN,NaN,NaN,NaN,NaN,16.0,62.0,Average,Young,NaN
47,S048,Student_48,NaN,Male,4.0,2.0,37.0,NaN,NaN,Young,NaN
48,NaN,Student_49,16.0,NaN,89.0,69.0,NaN,NaN,NaN,Young,26.0
49,NaN,NaN,NaN,NaN,NaN,71.0,NaN,92.0,Good,Young,NaN

In [280]:
#Add column with condition 
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
df["Category"]=df["Age"].apply(lambda x:"Adult" if x>=18 else "Young")
df.head()

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks,Category
0,NaN,Student_1,NaN,Female,88.0,26.0,26.0,93.0,Poor,Young
1,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0,Poor,Young
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN,NaN,Young
3,S004,NaN,NaN,Male,28.0,14.0,36.0,NaN,Excellent,Young
4,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN,NaN,Adult

**Remove a Column**

In [329]:
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
#df = df.drop('col', axis=1, inplace=True)#Wrong Way that cause df=None
df.drop("Age",axis=1,inplace=True)
df[4:10]

,Student_ID,Name,Gender,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
4,S005,NaN,Female,14.0,89.0,96.0,NaN,NaN
5,S006,Student_6,Male,44.0,41.0,50.0,92.0,Poor
6,S007,Student_7,NaN,NaN,76.0,NaN,68.0,Good
7,NaN,Student_8,NaN,88.0,NaN,NaN,65.0,Poor
8,NaN,Student_9,NaN,70.0,62.0,78.0,75.0,Poor
9,S010,NaN,NaN,8.0,NaN,NaN,88.0,Good

**Check if df=None or Not**

In [266]:
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
print("type(df) =", type(df))
print("columns =", getattr(df, 'columns', None))
print("head:\n", None if df is None else df.head())

type(df) = <class 'pandas.core.frame.DataFrame'>
columns = Index(['Student_ID', 'Name', 'Age', 'Gender', 'Math_Score', 'English_Score',
       'Science_Score', 'Attendance(%)', 'Remarks'],
      dtype='object')
head:
   Student_ID       Name   Age  Gender  Math_Score  English_Score  \
0        NaN  Student_1   NaN  Female        88.0           26.0
1        NaN  Student_2   NaN     NaN        59.0            NaN
2        NaN        NaN  17.0  Female        40.0           78.0
3       S004        NaN   NaN    Male        28.0           14.0
4       S005        NaN  19.0  Female        14.0           89.0

   Science_Score  Attendance(%)    Remarks
0           26.0           93.0       Poor
1            8.0           65.0       Poor
2           61.0            NaN        NaN
3           36.0            NaN  Excellent
4           96.0            NaN        NaN

In [341]:
#Drop multiple columns
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
df.drop(["Age","Gender"],axis=1,inplace=True)
df.iloc[0:5]

,Student_ID,Name,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
0,NaN,Student_1,88.0,26.0,26.0,93.0,Poor
1,NaN,Student_2,59.0,NaN,8.0,65.0,Poor
2,NaN,NaN,40.0,78.0,61.0,NaN,NaN
3,S004,NaN,28.0,14.0,36.0,NaN,Excellent
4,S005,NaN,14.0,89.0,96.0,NaN,NaN

In [343]:
#Use del keyword
del df["Name"]
df.head()

,Student_ID,Math_Score,English_Score,Science_Score,Attendance(%),Remarks
0,NaN,88.0,26.0,26.0,93.0,Poor
1,NaN,59.0,NaN,8.0,65.0,Poor
2,NaN,40.0,78.0,61.0,NaN,NaN
3,S004,28.0,14.0,36.0,NaN,Excellent
4,S005,14.0,89.0,96.0,NaN,NaN

In [349]:
#Use pop() method-->Delete column and return the data  that stay into the column
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
Remarks=df.pop("Remarks")
Remarks
df.iloc[10:15]

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%)
10,S011,Student_11,NaN,NaN,NaN,51.0,31.0,62.0
11,S012,Student_12,17.0,Female,0.0,NaN,NaN,79.0
12,NaN,NaN,NaN,Female,7.0,3.0,NaN,95.0
13,NaN,Student_14,NaN,Female,87.0,NaN,NaN,78.0
14,S015,Student_15,NaN,NaN,62.0,NaN,61.0,85.0

**07. Sorting & Reordering**

In [373]:
 # Sort only one column
copy=df.loc[0:10]
#copy.sort_values("Math_Score")#Wrong way assign must be needed
copy=copy.sort_values("Math_Score")#ascending
copy

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%)
9,S010,NaN,19.0,NaN,8.0,NaN,NaN,88.0
4,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN
3,S004,NaN,NaN,Male,28.0,14.0,36.0,NaN
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN
5,S006,Student_6,16.0,Male,44.0,41.0,50.0,92.0
1,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0
8,NaN,Student_9,NaN,NaN,70.0,62.0,78.0,75.0
0,NaN,Student_1,NaN,Female,88.0,26.0,26.0,93.0
7,NaN,Student_8,NaN,NaN,88.0,NaN,NaN,65.0
6,S007,Student_7,NaN,NaN,NaN,76.0,NaN,68.0
10,S011,Student_11,NaN,NaN,NaN,51.0,31.0,62.0

In [381]:
copy=copy.sort_values(["Science_Score","English_Score","Math_Score"],ascending=[0,1,0]) # Descending=0
copy

,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%)
4,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN
8,NaN,Student_9,NaN,NaN,70.0,62.0,78.0,75.0
2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN
5,S006,Student_6,16.0,Male,44.0,41.0,50.0,92.0
3,S004,NaN,NaN,Male,28.0,14.0,36.0,NaN
10,S011,Student_11,NaN,NaN,NaN,51.0,31.0,62.0
0,NaN,Student_1,NaN,Female,88.0,26.0,26.0,93.0
1,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0
6,S007,Student_7,NaN,NaN,NaN,76.0,NaN,68.0
7,NaN,Student_8,NaN,NaN,88.0,NaN,NaN,65.0
9,S010,NaN,19.0,NaN,8.0,NaN,NaN,88.0

In [417]:
copy=copy.reset_index()#Reset Index
copy

,level_0,index,Student_ID,Name,Age,Gender,Math_Score,English_Score,Science_Score,Attendance(%)
0,0,0,S005,NaN,19.0,Female,14.0,89.0,96.0,NaN
1,1,1,NaN,Student_9,NaN,NaN,70.0,62.0,78.0,75.0
2,2,2,NaN,NaN,17.0,Female,40.0,78.0,61.0,NaN
3,3,3,S006,Student_6,16.0,Male,44.0,41.0,50.0,92.0
4,4,4,S004,NaN,NaN,Male,28.0,14.0,36.0,NaN
5,5,5,S011,Student_11,NaN,NaN,NaN,51.0,31.0,62.0
6,6,6,NaN,Student_1,NaN,Female,88.0,26.0,26.0,93.0
7,7,7,NaN,Student_2,NaN,NaN,59.0,NaN,8.0,65.0
8,8,8,S007,Student_7,NaN,NaN,NaN,76.0,NaN,68.0
9,9,9,NaN,Student_8,NaN,NaN,88.0,NaN,NaN,65.0
10,10,10,S010,NaN,19.0,NaN,8.0,NaN,NaN,88.0

**8. Merging & Joining**

*8.1:Concatenation*

In [427]:
import pandas as pd 
df=pd.read_csv("students_with_nan.csv")
df1=df.loc[:5,'Math_Score']
df2=df.loc[2:7,"Science_Score"]
df_new = pd.concat([df1, df2], axis=0)  # row-wise
df_new

0    88.0
1    59.0
2    40.0
3    28.0
4    14.0
5    44.0
2    61.0
3    36.0
4    96.0
5    50.0
6     NaN
7     NaN
dtype: float64

In [429]:
df_new2 = pd.concat([df1, df2], axis=1)  # column-wise
df_new2

   Math_Score  Science_Score
0        88.0            NaN
1        59.0            NaN
2        40.0           61.0
3        28.0           36.0
4        14.0           96.0
5        44.0           50.0
6         NaN            NaN
7         NaN            NaN

*8.2:Merging*

In [434]:
df1 = pd.DataFrame({
    'Student_ID': ['S001', 'S002', 'S003', 'S004'],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math_Score': [85, 90, 78, 92]
})
df1
df2 = pd.DataFrame({
    'Student_ID': ['S002', 'S003', 'S004', 'S005'],
    'English_Score': [88, 75, 95, 80]
})
df1
#Merge 
new=pd.merge(df1,df2,on="Student_ID",how="right")#Join type: 'inner', 'left', 'right', 'outer'
new

  Student_ID     Name  Math_Score  English_Score
0       S002      Bob        90.0             88
1       S003  Charlie        78.0             75
2       S004    David        92.0             95
3       S005      NaN         NaN             80

*8.3:Joining*

In [447]:
df1.set_index('Student_ID').join(df2.set_index('Student_ID'), how='inner')#Common rows only (default)
df1

  Student_ID     Name  Math_Score
0       S001    Alice          85
1       S002      Bob          90
2       S003  Charlie          78
3       S004    David          92